{
  "_name_or_path": "./llm",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 6912,
  "max_position_embeddings": 4096,
  "model_max_length": 4096,
  "model_type": "llama",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "num_key_value_heads": 20,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 4096,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.2",
  "use_cache": true,
  "vocab_size": 32000,
  "mask_heads_dict":{"model.layers.0.self_attn": [0, 1, 2, 3], "model.layers.1.self_attn": [0, 1, 2, 3], "model.layers.2.self_attn": [0, 1, 2, 3], "model.layers.3.self_attn": [0, 1, 2, 3], "model.layers.4.self_attn": [0, 1, 2, 3], "model.layers.5.self_attn": [0, 1, 2, 3], "model.layers.6.self_attn": [0, 1, 2, 3], "model.layers.7.self_attn": [0, 1, 2, 3], "model.layers.8.self_attn": [0, 1, 2, 3], "model.layers.9.self_attn": [0, 1, 2, 3], "model.layers.10.self_attn": [0, 1, 2, 3], "model.layers.11.self_attn": [0, 1, 2, 3], "model.layers.12.self_attn": [0, 1, 2, 3], "model.layers.13.self_attn": [0, 1, 2, 3], "model.layers.14.self_attn": [0, 1, 2, 3], "model.layers.15.self_attn": [0, 1, 2, 3], "model.layers.16.self_attn": [0, 1, 2, 3], "model.layers.17.self_attn": [0, 1, 2, 3], "model.layers.18.self_attn": [0, 1, 2, 3], "model.layers.19.self_attn": [0, 1, 2, 3], "model.layers.20.self_attn": [0, 1, 2, 3], "model.layers.21.self_attn": [0, 1, 2, 3], "model.layers.22.self_attn": [0, 1, 2, 3], "model.layers.23.self_attn": [0, 1, 2, 3], "model.layers.24.self_attn": [0, 1, 2, 3], "model.layers.25.self_attn": [0, 1, 2, 3], "model.layers.26.self_attn": [0, 1, 2, 3], "model.layers.27.self_attn": [0, 1, 2, 3], "model.layers.28.self_attn": [0, 1, 2, 3], "model.layers.29.self_attn": [0, 1, 2, 3], "model.layers.30.self_attn": [0, 1, 2, 3], "model.layers.31.self_attn": [0, 1, 2, 3]}
}
