{
  "_name_or_path": "./llm",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 6912,
  "max_position_embeddings": 4096,
  "model_max_length": 4096,
  "model_type": "llama",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "num_key_value_heads": 20,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 4096,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.2",
  "use_cache": true,
  "vocab_size": 32000,
  "mask_heads_dict": {
    "model.layers.0.self_attn": [
      11,
      16,
      13,
      5
    ],
    "model.layers.1.self_attn": [
      18,
      12,
      9,
      17
    ],
    "model.layers.10.self_attn": [
      4,
      15,
      3,
      14
    ],
    "model.layers.11.self_attn": [
      12,
      2,
      9,
      18
    ],
    "model.layers.12.self_attn": [
      7,
      18,
      9,
      16
    ],
    "model.layers.13.self_attn": [
      13,
      8,
      4,
      17
    ],
    "model.layers.14.self_attn": [
      12,
      18,
      5,
      19
    ],
    "model.layers.15.self_attn": [
      3,
      16,
      18,
      9
    ],
    "model.layers.16.self_attn": [
      0,
      17,
      7,
      18
    ],
    "model.layers.17.self_attn": [
      11,
      3,
      8,
      12
    ],
    "model.layers.18.self_attn": [
      17,
      0,
      5,
      12
    ],
    "model.layers.19.self_attn": [
      19,
      12,
      2,
      0
    ],
    "model.layers.2.self_attn": [
      12,
      15,
      6,
      0
    ],
    "model.layers.20.self_attn": [
      2,
      15,
      10,
      14
    ],
    "model.layers.21.self_attn": [
      3,
      6,
      5,
      10
    ],
    "model.layers.22.self_attn": [
      18,
      9,
      12,
      8
    ],
    "model.layers.23.self_attn": [
      18,
      8,
      7,
      4
    ],
    "model.layers.24.self_attn": [
      14,
      17,
      5,
      0
    ],
    "model.layers.25.self_attn": [
      13,
      6,
      19,
      1
    ],
    "model.layers.26.self_attn": [
      10,
      3,
      13,
      8
    ],
    "model.layers.27.self_attn": [
      2,
      0,
      11,
      5
    ],
    "model.layers.28.self_attn": [
      6,
      1,
      2,
      9
    ],
    "model.layers.29.self_attn": [
      17,
      16,
      1,
      13
    ],
    "model.layers.3.self_attn": [
      6,
      5,
      15,
      9
    ],
    "model.layers.30.self_attn": [
      4,
      14,
      16,
      13
    ],
    "model.layers.31.self_attn": [
      0,
      10,
      8,
      6
    ],
    "model.layers.4.self_attn": [
      3,
      16,
      10,
      12
    ],
    "model.layers.5.self_attn": [
      15,
      6,
      11,
      4
    ],
    "model.layers.6.self_attn": [
      15,
      18,
      19,
      1
    ],
    "model.layers.7.self_attn": [
      18,
      6,
      11,
      10
    ],
    "model.layers.8.self_attn": [
      0,
      16,
      2,
      8
    ],
    "model.layers.9.self_attn": [
      0,
      14,
      15,
      18
    ]
  }
}
